---
kind: other
id: Methods.T:Autodesk.Revit.DB.IExportContextBase
source: html/ecedd9c6-45ce-44c9-f2c9-7e04a80fe4ab.htm
---
# IExportContextBase Methods

This method is called at the very end of the export process,
 after all entities were processed (or after the process was cancelled).